grevaillot/svd_tools/headers/ATSAM3X8H/memorymap.h
#pragma once 

#define HSMCI_BASE			(0x40000000)
#define SSC_BASE			(0x40004000)
#define SPI0_BASE			(0x40008000)
#define SPI1_BASE			(0x4000c000)
#define TC0_BASE			(0x40080000)
#define TC1_BASE			(0x40084000)
#define TC2_BASE			(0x40088000)
#define TWI0_BASE			(0x4008c000)
#define TWI1_BASE			(0x40090000)
#define PWM_BASE			(0x40094000)
#define USART0_BASE			(0x40098000)
#define USART1_BASE			(0x4009c000)
#define USART2_BASE			(0x400a0000)
#define USART3_BASE			(0x400a4000)
#define UOTGHS_BASE			(0x400ac000)
#define EMAC_BASE			(0x400b0000)
#define CAN0_BASE			(0x400b4000)
#define CAN1_BASE			(0x400b8000)
#define TRNG_BASE			(0x400bc000)
#define ADC_BASE			(0x400c0000)
#define DMAC_BASE			(0x400c4000)
#define DACC_BASE			(0x400c8000)
#define SMC_BASE			(0x400e0000)
#define SDRAMC_BASE			(0x400e0200)
#define MATRIX_BASE			(0x400e0400)
#define PMC_BASE			(0x400e0600)
#define UART_BASE			(0x400e0800)
#define CHIPID_BASE			(0x400e0940)
#define EFC0_BASE			(0x400e0a00)
#define EFC1_BASE			(0x400e0c00)
#define PIOA_BASE			(0x400e0e00)
#define PIOB_BASE			(0x400e1000)
#define PIOC_BASE			(0x400e1200)
#define PIOD_BASE			(0x400e1400)
#define PIOE_BASE			(0x400e1600)
#define PIOF_BASE			(0x400e1800)
#define RSTC_BASE			(0x400e1a00)
#define SUPC_BASE			(0x400e1a10)
#define RTT_BASE			(0x400e1a30)
#define WDT_BASE			(0x400e1a50)
#define RTC_BASE			(0x400e1a60)
#define GPBR_BASE			(0x400e1a90)
